cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'warrensbox/tap'

brew 'mas'

# devtools
brew 'bash'
brew 'bash-completion'
cask 'docker'
brew 'fish'
brew 'git'
brew 'jq'
brew 'neovim'
brew 'node@16', link: true
brew 'svn' # needed for fonts
brew 'yarn'
cask 'iterm2'
cask 'jetbrains-toolbox'

# infra automation
brew 'awscli'
brew 'warrensbox/tap/tfswitch'

# rando utils
brew 'curl'
brew 'wget'

# security/creds
cask '1password'
cask '1password-cli'

# apps
cask 'google-chrome'
cask 'slack'
cask 'tunnelbear'
mas 'Caffeinated', id: 1362171212
mas 'Clocks', id: 414554506
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'MindNode', id: 992076693
mas 'Trello', id: 1278508951

# fonts
cask 'font-andale-mono'
cask 'font-courier-prime-code'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-go'
cask 'font-hack'
cask 'font-iosevka'
cask 'font-menlo-for-powerline'
cask 'font-office-code-pro'
cask 'font-open-sans'
cask 'font-pt-mono'
cask 'font-roboto-mono'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-xkcd'
