cask_args appdir: '~/Applications'

tap 'fisherman/tap'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'jagregory/tools'

brew 'mas'

# devtools
brew 'adr-tools'
brew 'bash-completion'
brew 'blackbox'
brew 'cloc'
brew 'fish'
brew 'fisherman'
brew 'git'
brew 'git-crypt'
brew 'go'
brew 'jq'
brew 'mercurial'
brew 'neovim'
brew 'pyenv'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'watchman'
brew 'yarn'
cask 'docker-edge'
cask 'drawio'
cask 'graphiql'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'mongodb-compass-community'
cask 'monodraw'

# database
cask 'postgres'
mas 'SQLPro for Postgres', id: 976140091

# java
cask 'java'
brew 'maven'
brew 'tomcat'

# infra automation
brew 'ansible'
brew 'awscli'
brew 'packer'
brew 'rcm'
brew 's3cmd'
brew 'terraform'
cask 'vagrant'
cask 'virtualbox'

# rando utils
brew 'curl'
brew 'pngcrush'
brew 'telnet'
brew 'unrar'
brew 'watch'
brew 'wget'

# security/creds
brew 'envchain'
brew 'pwgen'
brew '1password-env'
cask '1password'
cask '1password-cli'
cask 'gpg-suite'
cask 'keybase'

# apps
cask 'caffeine'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'omnigraffle'
cask 'resilio-sync'
cask 'slack'
cask 'spotify'
cask 'tunnelbear'
mas 'Clocks', id: 414554506
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'MindNode', id: 992076693
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Trello', id: 1278508951
mas 'Unsplash Wallpapers', id: 1284863847
mas 'iA Writer', id: 775737590

# fonts
cask 'font-andale-mono'
cask 'font-courier-prime-code'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-go-mono'
cask 'font-hack'
cask 'font-iosevka'
cask 'font-menlo-for-powerline'
cask 'font-office-code-pro'
cask 'font-open-sans'
cask 'font-pt-mono'
cask 'font-roboto-mono'
cask 'font-ubuntu-mono-derivative-powerline'
cask 'font-xkcd'
